Pandas
- Series: 1-D array with heterogeneous data
- DataFrame: 2-D array with heterogeneous data

In [1]:
import pandas as pd

In [3]:
data = {
    'Product': ['apple', 'banana', 'cherry'],
    'Price':[200, 100, 500],
    'Quantity':[10, 20, 30]
}

In [4]:
df = pd.DataFrame(data)
df

  Product  Price  Quantity
0   apple    200        10
1  banana    100        20
2  cherry    500        30

In [5]:
df['Total'] = df['Price']*df['Quantity'] #here the length of both the coumns must be the same, or we'll need to clean it
df

  Product  Price  Quantity  Total
0   apple    200        10   2000
1  banana    100        20   2000
2  cherry    500        30  15000

In [10]:
df2 = df.drop(columns='Quantity')
df2

  Product  Price  Total
0   apple    200   2000
1  banana    100   2000
2  cherry    500  15000

In [15]:
df

  Product  Price  Quantity  Total
0   apple    200        10   2000
1  banana    100        20   2000
2  cherry    500        30  15000

In [16]:
# df.merge(df2, how='outer')
df.merge(df2, how='cross')

  Product_x  Price_x  Quantity  Total_x Product_y  Price_y  Total_y
0     apple      200        10     2000     apple      200     2000
1     apple      200        10     2000    banana      100     2000
2     apple      200        10     2000    cherry      500    15000
3    banana      100        20     2000     apple      200     2000
4    banana      100        20     2000    banana      100     2000
5    banana      100        20     2000    cherry      500    15000
6    cherry      500        30    15000     apple      200     2000
7    cherry      500        30    15000    banana      100     2000
8    cherry      500        30    15000    cherry      500    15000

In [18]:
df.mean(numeric_only=True)

Price        266.666667
Quantity      20.000000
Total       6333.333333
dtype: float64

In [19]:
import numpy as np
np.mean(df['Total'])

6333.333333333333

In [20]:
df['Total'].mean()

6333.333333333333

In [21]:
data2 = {
    "Product": ["apple", "banana", "cherry", np.nan],
    "Price": [200, np.nan, 80, 500],
    "Quantity": [10, 20, 30, 15],
}

In [23]:
df3 = pd.DataFrame(data2)
df3

  Product  Price  Quantity
0   apple  200.0        10
1  banana    NaN        20
2  cherry   80.0        30
3     NaN  500.0        15

In [30]:
df3.fillna({'Product':""}, inplace=True)

In [32]:
df3.fillna(0)

  Product  Price  Quantity
0   apple  200.0        10
1  banana    0.0        20
2  cherry   80.0        30
3          500.0        15

In [47]:
df4 = pd.DataFrame()
df4['name'] = ('zp','jk')
df4

  name
0   zp
1   jk

In [54]:
df4.sort_index(axis=1,)

  name
0   zp
1   jk

In [60]:
df.set_index('Price')

      Product  Quantity  Total
Price
200     apple        10   2000
100    banana        20   2000
500    cherry        30  15000

In [66]:
df8 = df.sort_values(by='Price')

In [67]:
df8

  Product  Price  Quantity  Total
1  banana    100        20   2000
0   apple    200        10   2000
2  cherry    500        30  15000